package ru.geekbrains.java1.dz.dz1.АлександрРожнов;

/**
 * Created by I_V_Zhukov on 10.05.2016.
 */
public class Main {
    public static void main(String[] args) {

        /**
         * Р—Р°РґР°РЅРёРµ 2 в—Џ	РЎРѕР·РґР°С‚СЊ РїРµСЂРµРјРµРЅРЅС‹Рµ РІСЃРµС… РїСЂРѕР№РґРµРЅРЅС‹С… С‚РёРїРѕРІ РґР°РЅРЅС‹С…, Рё РёРЅРёС†РёР°Р»РёР·РёСЂРѕРІР°С‚СЊ РёС… Р·РЅР°С‡РµРЅРёСЏ
         */

        //РїРµСЂРµРјРµРЅРЅС‹Рµ Рё РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ

        byte b = 120;
        short s = -3000;
        int i = 32500000;
        long l = 25600000000000L;
        float f = 11.7f;
        double d = 299.72d;
        boolean a = true; //false
        char c = 'D'; //char ch = 1500


        //РІС‹РІРѕРґ СЂРµР·СѓР»СЊС‚Р°С‚РѕРІ СЂР°СЃС‡РµС‚Р° РІ РєРѕРЅСЃРѕР»СЊ

        System.out.println("--------Р’С‹С‡РёСЃР»РµРЅРёРµ РІС‹СЂР°Р¶РµРЅРёСЏ--------------");
        System.out.println(calc(36, 451, 10, 244)); // Р”Р»СЏ СЂРµР·СѓР»СЊС‚Р°С‚Р° false   System.out.println(calc(36, 451, 10, 0));
        System.out.println("--------РџСЂРѕРІРµСЂРєР° СЃСѓРјРјС‹ РІ РґРёР°РїР°Р·РѕРЅРµ--------");
        System.out.println(range(17, 2)); //   Р”Р»СЏ СЂРµР·СѓР»СЊС‚Р°С‚Р° false  System.out.println(range(17,8));
        System.out.println("--------РћРїСЂРµРґРµР»РµРЅРёРµ РіРѕРґР°------------------");
        System.out.println(leapyear(2020));

    }


    /**
     * Р—Р°РґР°РЅРёРµ 3 в—Џ	РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ РІС‹С‡РёСЃР»СЏСЋС‰РёР№ РІС‹СЂР°Р¶РµРЅРёРµ a * (b + (c / d)) Рё РІРѕР·РІСЂР°С‰Р°СЋС‰РёР№ СЂРµР·СѓР»СЊС‚Р°С‚,
     * РіРґРµ a,b,c,d вЂ“ РІС…РѕРґРЅС‹Рµ РїР°СЂР°РјРµС‚СЂС‹ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°.
     */

    private static int calc(int a, int b, int c, int d) {



        if (d != 0) {            // СѓСЃР»РѕРІРёРµ РґР»СЏ РІС‹РІРѕРґР° СЂРµР·СѓР»СЊС‚Р°С‚Р° РµСЃР»Рё РІ Р·РЅР°РјРµРЅР°С‚РµР»Рµ РЅРѕР»СЊ

            return a * (b + (c / d));

        } else {//!

            System.out.println("D РЅРµ РјРѕР¶РµС‚ Р±С‹С‚СЊ СЂР°РІРµРЅ РЅСѓР»СЋ");
        }

        return a * (b + (c / d));//!
    }


    /**
     * Р—Р°РґР°РЅРёРµ 4 в—Џ	в—Џ	РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ, РїСЂРёРЅРёРјР°СЋС‰РёР№ РЅР° РІС…РѕРґ РґРІР° С‡РёСЃР»Р°,
     * Рё РїСЂРѕРІРµСЂСЏСЋС‰РёР№ С‡С‚Рѕ РёС… СЃСѓРјРјР° Р»РµР¶РёС‚ РІ РїСЂРµРґРµР»Р°С… 10 РґРѕ 20, РµСЃР»Рё РґР° вЂ“ РІРµСЂРЅСѓС‚СЊ true, РІ РїСЂРѕС‚РёРІРЅРѕРј СЃР»СѓС‡Р°Рµ вЂ“ false.
     */

    private static boolean range(int a, int b) {

        int sum = a + b;

        if (sum >= 10 & sum <= 20) {

            return true;

        } else {

            return false;//!
        }

    }


    /**
     * РќР°РїРёСЃР°С‚СЊ РјРµС‚РѕРґ, РєРѕС‚РѕСЂС‹Р№ РѕРїСЂРµРґРµР»СЏРµС‚ СЏРІР»СЏРµС‚СЃСЏ Р»Рё РіРѕРґ РІРёСЃРѕРєРѕСЃРЅС‹Рј.
     * РљР°Р¶РґС‹Р№ 4-Р№ РіРѕРґ СЏРІР»СЏРµС‚СЃСЏ РІРёСЃРѕРєРѕСЃРЅС‹Рј, РєСЂРѕРјРµ РєР°Р¶РґРѕРіРѕ 100-РіРѕ, РїСЂРё СЌС‚РѕРј РєР°Р¶РґС‹Р№ 400-Р№ вЂ“ РІРёСЃРѕРєРѕСЃРЅС‹Р№.
     */

    private static boolean leapyear(int a) {

        if (a % 4 == 0) {

            return true;
        }

        else if (a % 100 ==0){

            return false;
        }

        if (a % 400 ==0) {

            return true;
        }

        return false;
    }


}

