package geekbrains.homework.cours2hw4;

/**
 * Created by Владимир on 20.06.2016.
 */
/*         Создать окно для клиентской части чата(большое текстовое поле для отображения переписки,
        однострочное текстовое поле для ввода сообщений, кнопка для отсылки сообщений).
        Сообщение должно отсылаться либо по нажатию кнопки на форме, либо по нажатию кнопки
        Enter. "Отправленное" сообщение должно появиться в большом текстовом поле, и
        продублировано в текстовый файл.
           Для записи в файл можно использовать PrintWriter pw = new PrintWriter(new FileWriter("1.txt"));
        pw.write(...);*/
public class MainChat
{
    public static void main(String[] args) {
        ChatForm w = new ChatForm();
    }

}
