package ru.geekbrains.java1.dz.dz1.МаксимСараев;

/**
 * Created by I_V_Zhukov on 10.05.2016.
 */
public class Main {
    public static void main (String[] args) {

        // РњРµС‚РѕРґ РёРЅРёС†РёР°Р»РёР·РёСЂСѓСЋС‰РёР№ РїРµСЂРµРјРµРЅРЅС‹Рµ
        initialVar ();

        // РњРµС‚РѕРґ РІС‹С‡РёСЃР»СЏСЋС‰РёР№ РІС‹СЂР°Р¶РµРЅРёРµ a * (b + (c / d)) Рё РІРѕР·РІСЂР°С‰Р°СЋС‰РёР№ СЂРµР·СѓР»СЊС‚Р°С‚, РіРґРµ a,b,c,d вЂ“ РІС…РѕРґРЅС‹Рµ РїР°СЂР°РјРµС‚СЂС‹ СЌС‚РѕРіРѕ РјРµС‚РѕРґР°
        double a, b, c, d;
        a = 2;
        b = 2;
        c = 10;
        d = 3;
        System.out.println("Р’С‹РїРѕР»РЅСЏРµС‚СЃСЏ РјРµС‚РѕРґ РІС‹С‡РёСЃР»СЏСЋС‰РёР№ РІС‹СЂР°Р¶РµРЅРёРµ a * (b + (c / d)) ...");
        System.out.println("Р’С…РѕРґРЅС‹Рµ РїР°СЂР°РјРµС‚СЂС‹ "+a+", "+b+", "+c+", "+d);
        System.out.println("РћС‚РІРµС‚ "+metod1(a,b,c,d));

        // РњРµС‚РѕРґ РїСЂРёРЅРёРјР°СЋС‰РёР№ РЅР° РІС…РѕРґ РґРІР° С‡РёСЃР»Р°, Рё РїСЂРѕРІРµСЂСЏСЋС‰РёР№ С‡С‚Рѕ РёС… СЃСѓРјРјР° Р»РµР¶РёС‚ РІ РїСЂРµРґРµР»Р°С… 10 РґРѕ 20, РµСЃР»Рё РґР° вЂ“ РІРµСЂРЅСѓС‚СЊ true, РІ РїСЂРѕС‚РёРІРЅРѕРј СЃР»СѓС‡Р°Рµ вЂ“ false.
        double x, y;
        x = 2;
        y = 10;
        System.out.println("Р’С‹РїРѕР»РЅСЏРµС‚СЃСЏ РјРµС‚РѕРґ, РїСЂРёРЅРёРјР°СЋС‰РёР№ РЅР° РІС…РѕРґ РґРІР° С‡РёСЃР»Р°, Рё РїСЂРѕРІРµСЂСЏСЋС‰РёР№ С‡С‚Рѕ РёС… СЃСѓРјРјР° Р»РµР¶РёС‚ РІ РїСЂРµРґРµР»Р°С… 10 РґРѕ 20 ...");
        System.out.println("Р’С…РѕРґРЅС‹Рµ РїР°СЂР°РјРµС‚СЂС‹ "+x+", "+y);
        System.out.println("РћС‚РІРµС‚ "+metod2(x,y));

        // РњРµС‚РѕРґ РѕРїСЂРµРґРµР»СЏРµС‚ СЏРІР»СЏРµС‚СЃСЏ Р»Рё РіРѕРґ РІРёСЃРѕРєРѕСЃРЅС‹Рј. РљР°Р¶РґС‹Р№ 4-Р№ РіРѕРґ СЏРІР»СЏРµС‚СЃСЏ РІРёСЃРѕРєРѕСЃРЅС‹Рј, РєСЂРѕРјРµ РєР°Р¶РґРѕРіРѕ 100-РіРѕ, РїСЂРё СЌС‚РѕРј РєР°Р¶РґС‹Р№ 400-Р№ вЂ“ РІРёСЃРѕРєРѕСЃРЅС‹Р№.
        int year;
        year = 2016;
        System.out.println("Р’С‹РїРѕР»РЅСЏРµС‚СЃСЏ РјРµС‚РѕРґ, РѕРїСЂРµРґРµР»СЏСЋС‰РёР№ СЏРІР»СЏРµС‚СЃСЏ Р»Рё РіРѕРґ РІРёСЃРѕРєРѕСЃРЅС‹Рј. РљР°Р¶РґС‹Р№ 4-Р№ РіРѕРґ СЏРІР»СЏРµС‚СЃСЏ РІРёСЃРѕРєРѕСЃРЅС‹Рј, РєСЂРѕРјРµ РєР°Р¶РґРѕРіРѕ 100-РіРѕ, РїСЂРё СЌС‚РѕРј РєР°Р¶РґС‹Р№ 400-Р№ вЂ“ РІРёСЃРѕРєРѕСЃРЅС‹Р№. ...");
        System.out.println("Р’С…РѕРґРЅС‹Рµ РїР°СЂР°РјРµС‚СЂС‹ "+year);
        System.out.println("РћС‚РІРµС‚ "+metod3(year));

    }

    private static void initialVar () {

        System.out.println("Р’С‹РїРѕР»РЅСЏРµС‚СЃСЏ РјРµС‚РѕРґ РёРЅРёС†РёР°Р»РёР·РёСЂСѓСЋС‰РёР№ РїРµСЂРµРјРµРЅРЅС‹Рµ ...");

        /*
            8 РїСЂРёРјРёС‚РёРЅС‹С… С‚РёРїРѕРІ: 4 С†РµР»РѕС‡РёРёСЃР»РµРЅРЅС‹С…, 2 СЃ РїР»Р°РІР°СЋС‰РµР№ Р·Р°РїСЏС‚РѕР№, 1 СЃРёРјРІРѕР»СЊРЅС‹Р№ С‚РёРї, 1 Р»РѕРіРёС‡РµСЃРєРёР№
            1 СЃСЃС‹Р»РѕС‡РЅС‹Р№ С‚РёРї: 1 С…СЂР°РЅРµРЅРёРµ СЃС‚СЂРѕРє
         */


        /*
            Java РѕРїСЂРµРґРµР»СЏРµС‚ С‡РµС‚С‹СЂРµ С†РµР»РѕС‡РёСЃР»РµРЅРЅС‹С… С‚РёРїР°: byte, short, int, long. РћРЅРё РјРѕРіСѓС‚ Р±С‹С‚СЊ РїРѕР»РѕР¶РёС‚РµР»СЊРЅС‹РјРё Рё РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹РјРё
            (Java РЅРµ РїРѕРґРґРµСЂР¶РёРІР°РµС‚ С‚РѕР»СЊРєРѕ РїРѕР»РѕР¶РёС‚РµР»СЊРЅС‹Рµ Р·РЅР°С‡РµРЅРёСЏ Р±РµР· Р·РЅР°РєР°, РєР°Рє РЅРµРєРѕС‚РѕСЂС‹Рµ СЏР·С‹РєРё РїСЂРѕРіСЂР°РјРјРёСЂРѕРІР°РЅРёСЏ).
         */

        // byte вЂ“ 8-Р±РёС‚РЅРѕРµ Р·РЅР°РєРѕРІРѕРµ С†РµР»РѕРµ С‡РёСЃР»Рѕ. Р—РЅР°С‡РµРЅРёСЏ: РѕС‚ -128 РґРѕ 127.
        byte varByteType = 127;
        System.out.println(varByteType);

        // short вЂ“ 16-Р±РёС‚РЅРѕРµ Р·РЅР°РєРѕРІРѕРµ С†РµР»РѕРµ С‡РёСЃР»Рѕ. Р—РЅР°С‡РµРЅРёСЏ: РѕС‚ -32768 РґРѕ 32767.
        short varShortType = -32768;
        System.out.println(varShortType);

        // int вЂ“ 32-Р±РёС‚РЅРѕРµ Р·РЅР°РєРѕРІРѕРµ С†РµР»РѕРµ С‡РёСЃР»Рѕ. Р—РЅР°С‡РµРЅРёСЏ: РѕС‚ -2147483648 РґРѕ 2147483647.
        int varIntType = 2147483647;
        System.out.println(varIntType);

        // 64-Р±РёС‚РЅРѕРµ Р·РЅР°РєРѕРІРѕРµ С†РµР»РѕРµ С‡РёСЃР»Рѕ. Р—РЅР°С‡РµРЅРёСЏ: РѕС‚ -9223372036854775808 РґРѕ 9223372036854775807
        long varLongType = 9223372036854775807L;
        System.out.println(varLongType);

        /*
            Р§РёСЃР»Р° СЃ РїР»Р°РІР°СЋС‰РµР№ С‚РѕС‡РєРѕР№ (РёРЅРѕРіРґР° РёС… РЅР°Р·С‹РІР°СЋС‚ РґРµР№СЃС‚РІРёС‚РµР»СЊРЅС‹РјРё С‡РёСЃР»Р°РјРё)
            РїСЂРёРјРµРЅСЏСЋС‚СЃСЏ РїСЂРё РІС‹С‡РёСЃР»РµРЅРёРё РІС‹СЂР°Р¶РµРЅРёР№, РІ РєРѕС‚РѕСЂС‹С… С‚СЂРµР±СѓРµС‚СЃСЏ С‚РѕС‡РЅРѕСЃС‚СЊ РґРѕ РґРµСЃСЏС‚РёС‡РЅРѕРіРѕ Р·РЅР°РєР°.
            РќР°РїСЂРёРјРµСЂ, СЌС‚Рѕ РјРѕР¶РµС‚ Р±С‹С‚СЊ РІС‹С‡РёСЃР»РµРЅРёРµ РєРІР°РґСЂР°С‚РЅРѕРіРѕ РєРѕСЂРЅСЏ, Р·РЅР°С‡РµРЅРёР№ СЃРёРЅСѓСЃР°, РєРѕСЃРёРЅСѓСЃР° Рё С‚.Рї.
            РЎСѓС‰РµСЃС‚РІСѓРµС‚ РґРІР° С‚РёРїР° СЃ РїР»Р°РІР°СЋС‰РµР№ С‚РѕС‡РєРѕР№: float Рё double, РєРѕС‚РѕСЂС‹Рµ РїСЂРµРґСЃС‚Р°РІР»СЏСЋС‚ С‡РёСЃР»Р° РѕРґРёРЅР°СЂРЅРѕР№ Рё РґРІРѕР№РЅРѕР№ С‚РѕС‡РЅРѕСЃС‚Рё.
         */

        float varFloatType = 100.5f;
        System.out.println(varFloatType);

        double varDoubleType = 50.18d;
        System.out.println(varDoubleType);

        /*
            Р”Р»СЏ С…СЂР°РЅРµРЅРёСЏ СЃРёРјРІРѕР»РѕРІ Java РёСЃРїРѕР»СЊР·СѓРµС‚ СЃРїРµС†РёР°Р»СЊРЅС‹Р№ С‚РёРї char. РћРЅ РѕС‚Р»РёС‡Р°РµС‚СЃСЏ РѕС‚ С‚РёРїР° char РІ СЏР·С‹РєР°С… C/C++,
            РіРґРµ РїСЂРµРґСЃС‚Р°РІР»СЏРµС‚ СЃРѕР±РѕР№ С†РµР»РѕС‡РёСЃР»РµРЅРЅС‹Р№ С‚РёРї СЃ СЂР°Р·РјРµСЂРѕРј 8 Р±РёС‚. Р’ Java РґР»СЏ char РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ РєРѕРґРёСЂРѕРІРєР°
            Unicode Рё РґР»СЏ С…СЂР°РЅРµРЅРёСЏ Unicode-СЃРёРјРІРѕР»РѕРІ РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ 16 Р±РёС‚.
            Р”РёР°РїР°Р·РѕРЅ РґРѕРїСѓСЃС‚РёРјС‹С… Р·РЅР°С‡РµРЅРёР№ - РѕС‚ 0 РґРѕ 65536 (РѕС‚СЂРёС†Р°С‚РµР»СЊРЅС‹С… Р·РЅР°С‡РµРЅРёР№ РЅРµ СЃСѓС‰РµСЃС‚РІСѓРµС‚).
            РџРµСЂРµРјРµРЅРЅРѕР№ РјРѕР¶РЅРѕ РїСЂРёСЃРІРѕРёС‚СЊ РєРѕРґ СЃРёРјРІРѕР»Р° РёР»Рё РЅРµРїРѕСЃСЂРµРґСЃС‚РІРµРЅРЅРѕ СЃР°Рј СЃРёРјРІРѕР», РєРѕС‚РѕСЂС‹Р№ СЃР»РµРґСѓРµС‚ РѕРєСЂСѓР¶РёС‚СЊ РѕРґРёРЅР°СЂРЅС‹РјРё РєР°РІС‹С‡РєР°РјРё !!!
         */

        char varCharType = 51715;
        System.out.println(varCharType);

        /*
            РўРёРї boolean РїСЂРµРґРЅР°Р·РЅР°С‡РµРЅ РґР»СЏ С…СЂР°РЅРµРЅРёСЏ Р»РѕРіРёС‡РµСЃРєРёС… Р·РЅР°С‡РµРЅРёР№ Рё РјРѕР¶РµС‚ РїСЂРёРЅРёРјР°С‚СЊ С‚РѕР»СЊРєРѕ РѕРґРЅРѕ РёР· РґРІСѓС… РІРѕР·РјРѕР¶РЅС‹С… Р·РЅР°С‡РµРЅРёР№: true РёР»Рё false.
            Р”Р°РЅРЅС‹Р№ С‚РёРї РІСЃРµРіРґР° РІРѕР·РІСЂР°С‰Р°РµС‚СЃСЏ РїСЂРё РёСЃРїРѕР»СЊР·РѕРІР°РЅРёРё РѕРїРµСЂР°С‚РѕСЂРѕРІ СЃСЂР°РІРЅРµРЅРёСЏ (Р±РѕР»СЊС€Рµ, РјРµРЅСЊС€Рµ, СЂР°РІРЅРѕ, Р±РѕР»СЊС€Рµ РёР»Рё СЂР°РІРЅРѕ, РјРµРЅСЊС€Рµ РёР»Рё СЂР°РІРЅРѕ, РЅРµ СЂР°РІРЅРѕ).
            РўР°РєР¶Рµ РѕРЅ РёСЃРїРѕР»СЊР·СѓРµС‚СЃСЏ РІ СѓРїСЂР°РІР»СЏСЋС‰РёС… РѕРїРµСЂР°С‚РѕСЂР°С… if Рё for.
         */

        boolean varBooleanType = true;
        System.out.println(varBooleanType);

        /*
            РўРёРї String РЅРµ СЏРІР»СЏРµС‚СЃСЏ РїСЂРёРјРёС‚РёРІРЅС‹Рј С‚РёРїРѕРј РґР°РЅРЅС‹С…, РѕРґРЅР°РєРѕ СЌС‚Рѕ РѕРґРёРЅ РёР· РЅР°РёР±РѕР»РµРµ РёСЃРїРѕР»СЊР·СѓРµРјС‹С… С‚РёРїРѕРІ РІ Java.
            String  РїСЂРµРґРЅР°Р·РЅР°С‡РµРЅ РґР»СЏ С…СЂР°РЅРµРЅРёСЏ СЃС‚СЂРѕРє С‚РµРєСЃС‚Р°.
         */

        String varStringType = new String("Р—Р°РґР°РЅРёРµ Рє СѓСЂРѕРєСѓ в„–1");
        System.out.println(varStringType);
    }

    private static double metod1(double a, double b, double c, double d){

        return a * (b + c / d);//!

    }

    private static boolean metod2(double x, double y) {

        double resultSumma = x + y;
        if(resultSumma >= 10 & resultSumma <= 20)
            return true;

        return false;
    }

    private static boolean metod3(int year) {

        if (year%400 == 0)
        {return true;}
        else if (year%4 == 0 & year%100 != 0)
        {return true;}

        return false;
    }
}
