package ru.geekbrains.java1.dz.dz1.ПавелСуходоев;

/**
 * Created by I_V_Zhukov on 10.05.2016.
 */
public class Main {
    public static void main(String[] args) throws Exception {
        //РћР±СЉСЏРІР»РµРЅРёРµ Рё РёРЅРёС†РёР°Р»РёР·Р°С†РёСЏ РїРµСЂРµРјРµРЅРЅС‹С… РІСЃРµС… С‚РёРїРѕРІ РёР· Р”Р—
        byte a = 10;
        short b = 3232;
        int c = 32100;
        long d = 2343L;
        float e = 1.43f;
        double f = 2121.32d;
        boolean g = true;
        char h = 'a';

        //Р Р°СЃС‡РµС‚ РІС‹СЂР°Р¶РµРЅРёСЏ
        calculate(3, 4, -8, 0);
        //РџСЂРѕРІРµСЂРєР° СЃСѓРјРјС‹
        System.out.println(checkSum(3, 10));
        //РџСЂРѕРІРµСЂРєР° РіРѕРґР° РЅР° РІРёСЃРѕРєРѕСЃРЅРѕСЃС‚СЊ РїРѕ РїСЂР°РІРёР»Р°Рј Р”Р—
        System.out.println(isLeap(800));
    }

    /**
     * Р’С‹С‡РёСЃР»РµРЅРёРµ РІС‹СЂР°Р¶РµРЅРёСЏ РёР· Р”Р—
     * @param a
     * @param b
     * @param c
     * @param d
     * @return void
     */
    static void calculate (float a, float b, float c, float d) {
        /*
            Р’РЅР°С‡Р°Р»Рµ СЏ РґСѓРјР°Р», С‡С‚Рѕ РїСЂР°РІРёР»СЊРЅРµРµ Р±СѓРґРµС‚ РѕР±СЂР°Р±РѕС‚Р°С‚СЊ РёСЃРєР»СЋС‡РµРЅРёРµ РїСЂРё РґРµР»РµРЅРёРё РЅР° РЅРѕР»СЊ
            РќРѕ РїРѕСЌРєСЃРїРµСЂРёРјРµРЅС‚РёСЂРѕРІР°РІ, РїРѕРЅСЏР», С‡С‚Рѕ РїРѕС…РѕР¶Рµ РІ РЅРµРіРѕ РЅРёРєРѕРіРґР° РЅРµ РїРѕРїР°РґСѓ, РїРѕС‚РѕРјСѓ С‡С‚Рѕ РґРµР»РµРЅРёРµ
            РЅР° РЅРѕР»СЊ РІРѕР·РІСЂР°С‰Р°РµС‚ Р»РёР±Рѕ РїР»СЋСЃ Р±РµСЃРєРѕРЅРµС‡РЅРѕСЃС‚СЊ, Р»РёР±Рѕ РјРёРЅСѓСЃ Р±РµСЃРєРѕРЅРµС‡РЅРѕСЃС‚СЊ
            РџРѕСЌС‚РѕРјСѓ СЂРµС€РёР» СЃРґРµР»Р°С‚СЊ РїСЂРѕРІРµСЂРєСѓ РЅР° Р±РµСЃРєРѕРЅРµС‡РЅРѕСЃС‚СЊ РёРјРµРЅРЅРѕ С‚Р°РєРёРј РѕР±СЂР°Р·РѕРј, РЅРѕ РѕСЃС‚Р°РІРёР»
            РѕР±СЂР°Р±РѕС‚РєСѓ РёСЃРєР»СЋС‡РµРЅРёСЏ РґР»СЏ РЅР°РіР»СЏРґРЅРѕСЃС‚Рё
            Double.POSITIVE_INFINITY Рё NEGATIVE_INFINITY - РєРѕРЅСЃС‚Р°РЅС‚С‹ РєР»Р°СЃСЃР° Double (РѕР±РµСЂС‚РєРё Р±Р°Р·РѕРІРѕРіРѕ С‚РёРїР° double).
         */
        try {
            double result = a * (b + (c / d));//!
            if (result == Double.POSITIVE_INFINITY || result == Double.NEGATIVE_INFINITY) {
                System.out.println("РџРѕС…РѕР¶Рµ РґРµР»РёР»Рё РЅР° РЅРѕР»СЊ");
            } else {
                System.out.println(result);
            }
            //Р’ СЌС‚Рѕ РёСЃРєР»СЋС‡РµРЅРёРµ РјС‹ РЅРёРєРѕРіРґР° РЅРµ РїРѕРїР°РґРµРј.
        } catch (Exception e) {
            System.out.println("РќР° РЅРѕР»СЊ РґРµР»РёС‚СЊ РЅРµР»СЊР·СЏ " + e.getMessage());
        }
    }

    /**
     * РџСЂРѕРІРµСЂРєР° СЃСѓРјРјС‹ РІ РґРёР°РїР°Р·РѕРЅРµ РѕС‚ 10 РґРѕ 20, РѕРїРµСЂР°С‚РѕСЂ &
     * @param a
     * @param b
     * @return boolean
     */
    static boolean checkSum (int a, int b) {
        return a + b >= 10 & a + b <= 20;
    }

    /**
     * РџСЂРѕРІРµСЂРєР° РіРѕРґР° РЅР° РІРёСЃРѕРєРѕСЃРЅРѕСЃС‚СЊ РїРѕ РїСЂР°РІРёР»Р°Рј РёР· Р”Р—
     * Р’РёСЃРѕРєРѕСЃРЅС‹Рј СЃС‡РёС‚Р°РµС‚СЃСЏ РіРѕРґ РєСЂР°С‚РЅС‹Р№ 4, РЅРµ РєСЂР°С‚РЅС‹Р№ 100 РєСЂРѕРјРµ РєСЂР°С‚РЅС‹С… 400, РѕРїРµСЂР°С‚РѕСЂС‹ && Рё ||
     * @param year
     * @return boolean
     */
    static boolean isLeap (int year) {
        /*
            РµСЃР»Рё РіРѕРґ РЅРµ РєСЂР°С‚РµРЅ С‡РµС‚С‹СЂРµРј - С‚РѕРіРґР° РѕРЅ СЃСЂР°Р·Сѓ РЅРµРІРёСЃРѕРєРѕСЃРЅС‹Р№ РґР°Р»СЊС€Рµ РЅРµ СЃРјРѕС‚СЂРёРј, РїРѕСЃРєРѕР»СЊРєСѓ false (&&)
            РµСЃР»Рё РіРѕРґ РєСЂР°С‚РµРЅ С‡РµС‚С‹СЂРµРј (РёСЃС‚РёРЅР°), С‚Рѕ РїСЂРѕРІРµСЂСЏРµРј РІС‚РѕСЂРѕР№ РѕРїРµСЂР°РЅРґ РІ СЃРєРѕР±РєР°С… РЅР° РёСЃС‚РёРЅСѓ
            year % 100 != 0 - РѕР±СЂР°С‰Р°РµС‚СЃСЏ РІ Р»РѕР¶СЊ, РµСЃР»Рё РіРѕРґ РєСЂР°С‚РµРЅ 100, С‚РѕР»СЊРєРѕ С‚РѕРіРґР° Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЃСЏ РµРіРѕ РєСЂР°С‚РЅРѕСЃС‚СЊ 400 (||)
            Рё РІС‹СЂР°Р¶РµРЅРёРµ РІ СЃРєРѕР±РєР°С… РїСЂРёРјРµС‚ Р·РЅР°С‡РµРЅРёРµ РёСЃС‚РёРЅР° С‚РѕР»СЊРєРѕ РµСЃР»Рё РіРѕРґ Р±СѓРґРµС‚ РµС‰Рµ Рё РєСЂР°С‚РµРЅ 400.
            РµСЃР»Рё Р¶Рµ year % 100 != 0 С‚Рѕ РµСЃС‚СЊ РЅРµ РєСЂР°С‚РµРЅ 100 (СЃСЂР°Р·Сѓ РІРёРґРёРј true РІ РїРµСЂРІРѕРј РѕРїРµСЂР°РЅРґРµ),
            С‚РѕРіРґР° РЅРµ Р±СѓРґРµС‚ РїСЂРѕРІРµСЂСЏС‚СЃСЏ РєСЂР°С‚РЅРѕСЃС‚СЊ 400 Рё РјРµС‚РѕРґ РІРµСЂРЅРµС‚ РёСЃС‚РёРЅСѓ, РїРѕСЃРєРѕР»СЊРєСѓ РіРѕРґ РІСЃРµ СЂР°РІРЅРѕ РєСЂР°С‚РµРЅ 4
         */

        return year % 4 == 0 && (year % 100 != 0 || year % 400 == 0);
    }
}